// 1) Даний об'єкт з містами та країнами. Вивести масив значення в якому будуть рядки перетворені на цей формат: <Столиця> - це <Країна>.

// 2) Створити функцію яка виведе багатовимірний масив A. Даний масив містить список інших масивів B. Масиви B повинні містити по 3 значення. Та вивести його максимальне значення

// 3) Створити об'єкт із назвами днів тижня. Де ключами будуть uk і en, a значенням властивості uk буде масив із назвами днів тижня українською, а en - англійською. Після написати функцію яка буде виводити в консоль назву дня тижня, користуючись вище створеним об'єктом. Усі дні тижня починаються з 1 і закінчуються цифрою 7 (1- понеділок, 7 - неділя). Функція отримує змінну lang – назву мови дня тижня та змінну day – число дня тижня.

// 4) Створіть функцію, яка повертає суму двох найменших позитивних чисел із масиву мінімум 4 позитивних цілих чисел. Не передаються числа з плаваючою комою або непозитивні цілі числа.

// 5) Даний масив одиниць і нулів, перетворіть еквівалентне двійкове значення ціле число.
// Наприклад: [0, 0, 0, 1] розглядається як 0001 двійкове уявлення 1.


// 1) Даний об'єкт з містами та країнами. Вивести масив значення в якому будуть рядки перетворені на цей формат: <Столиця> - це <Країна>.
const countries = {
    'Kyiv': 'Ukraine',
    'Warsaw': 'Poland',
    'Washington': 'USA',
    'Prague': 'Chech Republic',
    'London': 'Great Britain'
}

let resultArr = [];

for (let key in countries){
    resultArr.push(`<${key}> - це <${countries[key]}>`);
}

console.log(resultArr);

// 2) Створити функцію яка виведе багатовимірний масив A. Даний масив містить список інших масивів B. Масиви B повинні містити по 3 значення. Та вивести його максимальне значення.
const arrayA = [[1,2,3], [4,5,6], [7,8,9]];

function findMaxArr(array) {
    let maxArr = arrayA[0][0];
    for (let i of arrayA) {
        for (let j of i) {
            if (j > maxArr) {
                maxArr = j;
            }
        }
    }
    console.log(maxArr);
}

findMaxArr(arrayA);

// 3) Створити об'єкт із назвами днів тижня. Де ключами будуть uk і en, a значенням властивості uk буде масив із назвами днів тижня українською, а en - англійською. Після написати функцію яка буде виводити в консоль назву дня тижня, користуючись вище створеним об'єктом. Усі дні тижня починаються з 1 і закінчуються цифрою 7 (1- понеділок, 7 - неділя). Функція отримує змінну lang – назву мови дня тижня та змінну day – число дня тижня.
const weekDay = {
    uk: ['Понеділок', 'Вівторок', 'Середа', 'Четвер', 'П\'ятниця', 'Суббота', 'Неділя'],
    en: ['Monday', 'Tuesday', 'Wednesday', 'Thursday', 'Friday', 'Saturday', 'Sunday']
}

function getDayOfWeek(lang, day) {
    const langUk = weekDay.uk;
    const langEn = weekDay.en;
    const dayOfWeek = day - 1;

    if (lang === "uk") {
        console.log(langUk[dayOfWeek]);
    }else if (lang === "en") {
        console.log(langEn[dayOfWeek]);
    }
}

getDayOfWeek("uk", 5);
getDayOfWeek("en", 7);

// 4) Створіть функцію, яка повертає суму двох найменших позитивних чисел із масиву мінімум 4 позитивних цілих чисел. Не передаються числа з плаваючою комою або непозитивні цілі числа.
const numbers = [4.7, -1, 0, 100, 2, -35, 9, -4, 5, -1.8, 4.2, 38, 4, -35, 6.5];

function getSumPositiveNumber(array) {
    let arr = [];
    while(arr.length < 2) {
        let temp = array[0];
        let index = 0;
        for(let i = 0; i < array.length; i++) {
            if(!Number.isInteger(array[i]) || array[i] < 1) {
                continue;
            }
            if(array[i] < temp) {
                temp = array[i];
                index = i;
            }
        }
        arr.push(temp);
        array.splice(index,1);
    }

    const add = arr => arr.reduce((a, b) => a + b, 0);
    let sum = add(arr);
    console.log(sum);
}

getSumPositiveNumber(numbers);

// 5) Даний масив одиниць і нулів, перетворіть еквівалентне двійкове значення ціле число.
// Наприклад: [0, 0, 0, 1] розглядається як 0001 двійкове уявлення 1.
const binary = ['1','0','1','1','0','1','1','1'];
const integer = binary.join('');
let digit = parseInt(integer, 2);

console.log(digit);